app/controllers/customers_controller.rb

  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save
---
INSERT INTO "customers" ("address1", "address2", "city", "created_at", "firstname", "lastname", "state", "updated_at", "zipcode") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)