app/controllers/employees_controller.rb

INSERT INTO "employees" ("address1", "address2", "city", "created_at", "firstname", "lastname", "salary", "ssn", "state", "updated_at", "withholding", "zipcode") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save