app/controllers/vendors_controller.rb

SELECT "vendors".* FROM "vendors"
---
  def index
    @vendors = Vendor.all